package com.asprog.hotword.data.sample

object KeyLocalSimpleDataBase {

    val fourLetters = listOf<String>(
        "ПЕРЕ"
    )

    val threeLetters = listOf<String>(
        "ПОЛ",
        "ПОК",
        "КОР",
        "МЕТ",
        "БЕС",
        "ВОС",
        "КАР",
        "ЗАВ",
    )

    val twoLetters = listOf<String>(
        "АБ",
        "АВ",
        "АГ",
        "АД",
        "АК",
        "АЛ",
        "АМ",
        "АН",
        "АП",
        "AР",
        "AС",
        "AТ",

        "БА",
        "БЕ",
        "БИ",
        "БО",
        "БУ",

        "ВА",
        "ВЕ",
        "ВИ",
        "ВО",
        "ВУ",

        "ГА",
        "ГЕ",
        "ГИ",
        "ГО",
        "ГУ",

        "ДА",
        "ДЕ",
        "ДИ",
        "ДО",
        "ДУ",

        "ЕВ",
        "ЕД",
        "ЕР",

        "ЖА",
        "ЖЕ",
        "ЖИ",
        "ЖУ",

        "ЗА",
        "ЗЕ",
        "ЗИ",
        "ЗО",
        "ЗУ",

        "ИГ",
        "ИД",
        "ИК",
        "ИЛ",
        "ИМ",
        "ИН",
        "ИР",
        "ИС",

        //Й

        "КА",
        "КЕ",
        "КИ",
        "КО",
        "КУ",

        "ЛА",
        "ЛЕ",
        "ЛИ",
        "ЛО",
        "ЛУ",
    )

    val oneLetter = listOf<String>(
        "А",
        "Б",
        "В",
        "Г",
        "Д",
        "Е",
        "Ё",
        "Ж",
        "З",
        "И",
        "Й",
        "К",
        "Л",
        "М",
        "Н",
        "О",
        "П",
        "Р",
        "С",
        "Т",
        "У",
        "Ф",
        "Х",
        "Ц",
        "Ч",
        "Ш",
        "Щ",
        "Э",
        "Ю",
        "Я"
    )

    private val glass = listOf(
        "А",
        "Е",
        "И",
        "О",
        "У",
    )

}